
package com.brucezee.jspider.extrator;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * TODO:把这句替换成类的注释 <br/>
 * Date: 2018年9月19日 下午4:08:32 <br/>
 * 
 * @author hxfei
 */

public class Snippet {
	public static void main(String[] args) {
		String date = " 视频成都 当前位置： 首页 > 新闻 2018年中国药学大会在蓉举行 发布时间：2018-09-19日来源：成都日报访问量：次 访问量：345次 打印取消收藏收藏 [字体：大中小] 分享到： 焦红孙咸泽罗强出席开幕式并致辞 昨日，作为中国药学领域最高层次的学术会议——2018年中国药学大会在蓉开幕。国家药品监督管理局局长焦红，全国政协教科卫体委员会副主任、中国药学会理事长孙咸泽，市委副书记、市长罗强出席开幕式并致辞。 　　焦红说，药品安全责任重于泰山。国家药品监督管理局将坚持深化审评审批制度改革、全面从严监管、全面推进智慧监管和阳光监管不动摇，促进医药产业高质量发展，不断满足人民群众对高质量药品的期待。希望中国药学会更好发挥作用，为医药创新和产业发展、持续提高药品质量等提供科技支撑，为提升完善中国药品科学监管贡献力量，全面提高我国药学专家在国际舞台的话语权和影响力。 　　孙咸泽说，中国已成为全球第二大医药市场。未来，中国药学会将瞄准建设世界一流学会远大目标，全力推动新时代学会工作格局重塑、组织重构和流程再造，为繁荣和发展我国药学事业作出新贡献。 　　罗强说，医药健康产业是我市重点发展五大支柱产业之一。成都将加快打造国际知名、国内一流的医药健康研发创新中心、产业孵化中心和高端制造中心；强化医药市场监管，全面落实“四个最严”要求，加大执法力度，提升监管队伍职业化水平，落实企业主体责任，加快构建完善食品药品追溯体系，防范系统性、区域性风险，坚决守住安全底线。真诚希望各位专家学者多提宝贵意见建议，助力成都医药健康产业发展；热切期待国内外医药专家和企业来蓉投资兴业，转化研究成果。成都将持续营造有利于医药健康产业发展的良好环境，与大家共享成都机遇，共创美好未来。 　　开幕式上，中国药学会发布了第四批过度重复药品提示信息，颁发了第十三届中国药学会科学技术奖、第三届中国药学会—以岭生物医药奖，5名专家荣获生物医药创新奖，6名学者荣获生物医药青年奖。中国工程院院士黄璐琦、丁健、李松、王锐，中国科学院院士赵宇亮等发表主旨演讲，深入探讨药物创新领域热点话题。 　　省食品药品监督管理局局长鞠波，副市长刘旭光，以及来自科研院所、高等院校、医疗机构、医药企业等领域专家学者1500余人参加大会。（记者 常斐 张家华）  分享+ 打印 纠错 扫一扫在手机打开当前页 相关新闻 网络安全技术高峰论坛昨日在成都举行18-09-18 罗强昨日主持召开市政府第20次常务会议18-09-18 市委书记范锐平带队前往锦江区现场办公18-09-16 罗强会见法国智奥会展集团创始人、董事会主席奥利维尔·吉农一行18-09-15 范锐平罗强会见新加坡总理公署部长黄志明18-09-15 宣讲督导、蹲点调研、重点企业全覆盖走访专题汇报会举行　范锐平主持会议并讲话18-09-15 罗强分别会见英国怡和集团行政总裁班哲明·凯瑟克和威马汽车科技集团创始人、董事长沈晖一行18-09-14 罗强主持召开旅游工作专题会议18-09-13 罗强率队前往部分科技治霾试点项目现场办公18-09-12 罗强分别会见法国国家铁路总公司总经理和菲律宾佛罗里达布兰卡市市长一行18-09-12 市情 成都概况 投资环境 旅游资源 便民电话 成都地图 政府 市政府领导 常务会 政策文件 政策解读 发展规划 理政 书记信箱 市政府信箱 市长公开电话 成都面对面 意见征集 查询 社保查询 公积金查询 企业信用 电子警察 中小学信息 应用 网络理政平台 成都服务 成都发展改革 成都人社 成都信用 网站链接: 中央政府及部委 中国政府网 外交部 国防部 国家发展和改革委员会 教育部 科学技术部 工业和信息化部 国家民族事务委员会 国家公安部 民政部 司法部 财政部 人力资源和社会保障部 自然资源部 生态环境部 住房和城乡建设部 交通运输部 水利部 农业农村部 商务部 文化和旅游部 国家卫生健康委员会 应急管理部 人民银行 审计署 国资委 海关总署 税务总局 市场监管总局 国家广播电视总局 体育总局 统计局 参事室 国管局 国家认监委 标准委 版权局 宗教局 港澳办 国研室 侨办 台办 国家网信办 新闻办 新华社 中科院 社科院 工程院 发展研究中心 气象局 中国银保监会 证监会 行政学院 信访局 粮食和物资储备局 能源局 国防科工局 烟草局 移民管理局 林业和草原局 铁路局 民航局 邮政局 文物局 中医药局 煤矿安监局 外汇局 国家药品监督管理局 知识产权局 公务员局 档案局 密码局 国家语言文字工作委员会 外专局 航天局 原子能机构 海洋局 国家核安全局 法制办 地震局 社保基金会 自然科学基金会 测绘地信局 扶贫办 三峡办 南水北调办 中国铁路总公司 四川省政府及市州 四川省人民政府 自贡市 攀枝花 泸州市 德阳市 绵阳市 广元市 遂宁市 内江市 乐山市 南充市 宜宾市 广安市 达州市 巴中市 雅安市 眉山市 资阳市 阿坝州 甘孜州 凉山州 市级机构、垂直管理机构 市委组织部 市委编办 市直机关工委 市信访局 市发改委 市经信委 市教育局 市科技局 市民宗局 市公安局 市民政局 市司法局 市财政局 市人社局 市国土局 市环保局 市建委 市规划局 市房管局 市城管委 市交委 市口岸物流办 市水务局 市农委 市林业园林局 市商务委 市投促委 市文广新局 市卫计委 市审计局 市外事侨务办 市国资委 市工商局 市质监局 市食药监局 市体育局 市安监局 市统计局 市旅游局 市政府法制办 市金融局 市机关事务局 市人防办 市政府参事室 市政府研究室 成都经开区 市政府台办 国家税务总局成都市税务局 成调队 市公资交易中心 市气象局 市防震减灾局 市档案局 市地志办 成都公积金中心 市老龄办 区（市）县 成都天府新区 成都高新区 锦江区 青羊区 金牛区 武侯区 成华区 龙泉驿区 青白江区 新都区 温江区 双流区 郫都区 简阳市 都江堰市 彭州市 邛崃市 崇州市 金堂县 新津县 大邑县 蒲江县 省、市、地区 北京市 上海市 天津市 重庆市 河北省 石家庄市 山西省 太原市 内蒙古自治区 呼和浩特市 辽宁省 沈阳市 大连市 吉林省 长春市 黑龙江省 哈尔滨市 江苏省 南京市 苏州市 浙江省 杭州市 宁波市 安徽省 合肥市 福建省 福州市 厦门市 江西省 南昌市 山东省 济南市 青岛市 河南省 郑州市 洛阳市 湖北省 武汉市 湖南省 长沙市 广东省 广州市 深圳市 广西自治区 南宁市 海南省 海口市 贵州省 贵阳市 云南省 昆明市 西藏自治区 拉萨市 陕西省 西安市 甘肃省 兰州市 宁夏自治区 银川市 青海省 西宁市 新疆自治区 乌鲁木齐市 香港 澳门 本市其他网站 蓉城先锋智慧党建 市总工会 团市委 市妇联 市文联 市科协 市社科联 市工商联 市侨联 市博览局 市残联 市红十字会 市关工委 市农林科学院 市邮政管理局 成都市公安局交通管理局 成都大学 成都职业学院 成都农职学院 成都工职学院 市技师学院 成都银行 成都农商银行 成都产业集团 成都城投集团 成都传媒集团 成都交投集团 成都文旅集团 成都轨道集团 成都环境集团 成都兴城集团 市公交集团 成都金控集团 成都商物投集团 成都市现代农业发展投资有限公司 成都技术转移（集团）有限公司 成都市工程咨询公司 成都市企业服务平台 成都创业创新服务平台 成都小微企业双创网 成都电商公共服务网 成都市政府投资项目评审中心 “家在成都”网站 成都海关 成都市经济信息中心 成都年鉴社 成都市文化馆 成都人才网 成都大学生就业网 成都信用网 成都招生考试网 成都数字学校 市民终身学习平台 成都双流国际机场 天府软件园 成都市城市燃气公司 成都市自来水公司 国家电网成都供电公司 本市新闻媒体 成都日报 成都商报 成都晚报 成都电视台 成都人民广播电台 成都全搜索新闻网 市人大 | 市政协 | 市监委 | 市法院 | 市检察院 | 关于我们|法律声明|网站动态|便民电话|网站地图 关于我们|法律声明|便民电话 主办：成都市人民政府承办：成都市大数据和电子政务管理办公室维护：成都市经济信息中心 ©2001-2018 网站标识码5101000028 蜀ICP备05003365号川公网安备 51019002000387 号";
		isDate(date);
	}

	public static void isDate(String strDate) {
		Pattern pattern = Pattern.compile(
				"(\\d{4})[/\\-年](\\d{1,2})[/\\-月](\\d{1,2})[日]{0,1}");
		Matcher m = pattern.matcher(strDate);
		if(m.find()){
			String text=m.group();
			System.out.println(text);
		}
		
	}
}
